#### GridNodeLocation Enumeration

---

|  |
| --- |
| See Also |

Location of a grid node relative to the face boundary. See  DividedSurface  .

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum GridNodeLocation ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration GridNodeLocation ``` |

| Visual C++ |
| --- |
| ``` public enum class GridNodeLocation ``` |

# Members

| Member name | Description |
| --- | --- |
| Interior |  |
| Boundary |  |
| Exterior |  |

# See Also

Autodesk.Revit.DB Namespace